Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f13144.h
#define                                 PSCNT9_bit          _BIT_ACCESS(WDTPSH,1)
// ADCON2<PSIS>
extern volatile __bit                   PSIS                __at(0xE947);	// @ (0x1D28 * 8 + 7)
#define                                 PSIS_bit            _BIT_ACCESS(ADCON2,7)
// DAC1CON<PSS0>
extern volatile __bit                   PSS0                __at(0x4462);	// @ (0x88C * 8 + 2)
#define                                 PSS0_bit            _BIT_ACCESS(DAC1CON,2)
// DAC1CON<PSS1>
extern volatile __bit                   PSS1                __at(0x4463);	// @ (0x88C * 8 + 3)
#define                                 PSS1_bit            _BIT_ACCESS(DAC1CON,3)
// T2HLT<PSYNC>
extern volatile __bit                   PSYNC               __at(0x1C7F);	// @ (0x38F * 8 + 7)
#define                                 PSYNC_bit           _BIT_ACCESS(T2HLT,7)
// PWM1CON<PWM1EN>
extern volatile __bit                   PWM1EN              __at(0x4117);	// @ (0x822 * 8 + 7)
#define                                 PWM1EN_bit          _BIT_ACCESS(PWM1CON,7)
// PMD5<PWM1MD>
extern volatile __bit                   PWM1MD              __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 PWM1MD_bit          _BIT_ACCESS(PMD5,0)
// PWM1CON<PWM1OUT>
extern volatile __bit                   PWM1OUT             __at(0x4115);	// @ (0x822 * 8 + 5)
#define                                 PWM1OUT_bit         _BIT_ACCESS(PWM1CON,5)
// PWM1CON<PWM1POL>
extern volatile __bit                   PWM1POL             __at(0x4114);	// @ (0x822 * 8 + 4)
#define                                 PWM1POL_bit         _BIT_ACCESS(PWM1CON,4)
// PWM2CON<PWM2EN>
extern volatile __bit                   PWM2EN              __at(0x412F);	// @ (0x825 * 8 + 7)
#define                                 PWM2EN_bit          _BIT_ACCESS(PWM2CON,7)
// PMD5<PWM2MD>
extern volatile __bit                   PWM2MD              __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 PWM2MD_bit          _BIT_ACCESS(PMD5,1)
// PWM2CON<PWM2OUT>
extern volatile __bit                   PWM2OUT             __at(0x412D);	// @ (0x825 * 8 + 5)
#define                                 PWM2OUT_bit         _BIT_ACCESS(PWM2CON,5)
// PWM2CON<PWM2POL>
extern volatile __bit                   PWM2POL             __at(0x412C);	// @ (0x825 * 8 + 4)
#define                                 PWM2POL_bit         _BIT_ACCESS(PWM2CON,4)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE4<RC1IE>
extern volatile __bit                   RC1IE               __at(0x4D7);	// @ (0x9A * 8 + 7)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE4,7)
// PIR4<RC1IF>
extern volatile __bit                   RC1IF               __at(0x487);	// @ (0x90 * 8 + 7)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR4,7)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0x3C8B);	// @ (0x791 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x3C8B);	// @ (0x791 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0x3896);	// @ (0x712 * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// NVMCON1<RD>
extern volatile __bit                   RD                  __at(0xE480);	// @ (0x1C90 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(NVMCON1,0)
// T1CON<RD16>
extern volatile __bit                   RD16                __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 RD16_bit            _BIT_ACCESS(T1CON,1)
// T1CON<RD161>
extern volatile __bit                   RD161               __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 RD161_bit           _BIT_ACCESS(T1CON,1)
// CLBCON<RDHOLD>
extern volatile __bit                   RDHOLD              __at(0x2861);	// @ (0x50C * 8 + 1)
#define                                 RDHOLD_bit          _BIT_ACCESS(CLBCON,1)
// FVRCON<RDY>
extern volatile __bit                   RDY                 __at(0x1066);	// @ (0x20C * 8 + 6)
#define                                 RDY_bit             _BIT_ACCESS(FVRCON,6)
// SSP1STAT<READ_WRITE>
extern volatile __bit                   READ_WRITE          __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 READ_WRITE_bit      _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<READ_WRITE1>
extern volatile __bit                   READ_WRITE1         __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 READ_WRITE1_bit     _BIT_ACCESS(SSP1STAT,2)
// DAC1CON<REFRNG>
extern volatile __bit                   REFRNG              __at(0x4466);	// @ (0x88C * 8 + 6)
#define                                 REFRNG_bit          _BIT_ACCESS(DAC1CON,6)
// ADRESL<RES0>
extern volatile __bit                   RES0                __at(0xE8E8);	// @ (0x1D1D * 8 + 0)
#define                                 RES0_bit            _BIT_ACCESS(ADRESL,0)
// ADRESL<RES1>
extern volatile __bit                   RES1                __at(0xE8E9);	// @ (0x1D1D * 8 + 1)
#define                                 RES1_bit            _BIT_ACCESS(ADRESL,1)
// ADRESH<RES10>
extern volatile __bit                   RES10               __at(0xE8F2);	// @ (0x1D1E * 8 + 2)
#define                                 RES10_bit           _BIT_ACCESS(ADRESH,2)
// ADRESH<RES11>
extern volatile __bit                   RES11               __at(0xE8F3);	// @ (0x1D1E * 8 + 3)
#define                                 RES11_bit           _BIT_ACCESS(ADRESH,3)
// ADRESH<RES12>
extern volatile __bit                   RES12               __at(0xE8F4);	// @ (0x1D1E * 8 + 4)
#define                                 RES12_bit           _BIT_ACCESS(ADRESH,4)
// ADRESH<RES13>
extern volatile __bit                   RES13               __at(0xE8F5);	// @ (0x1D1E * 8 + 5)
#define                                 RES13_bit           _BIT_ACCESS(ADRESH,5)
// ADRESH<RES14>
extern volatile __bit                   RES14               __at(0xE8F6);	// @ (0x1D1E * 8 + 6)
#define                                 RES14_bit           _BIT_ACCESS(ADRESH,6)
// ADRESH<RES15>
extern volatile __bit                   RES15               __at(0xE8F7);	// @ (0x1D1E * 8 + 7)
#define                                 RES15_bit           _BIT_ACCESS(ADRESH,7)
// ADRESL<RES2>
extern volatile __bit                   RES2                __at(0xE8EA);	// @ (0x1D1D * 8 + 2)
#define                                 RES2_bit            _BIT_ACCESS(ADRESL,2)
// ADRESL<RES3>
extern volatile __bit                   RES3                __at(0xE8EB);	// @ (0x1D1D * 8 + 3)
#define                                 RES3_bit            _BIT_ACCESS(ADRESL,3)
// ADRESL<RES4>
extern volatile __bit                   RES4                __at(0xE8EC);	// @ (0x1D1D * 8 + 4)
#define                                 RES4_bit            _BIT_ACCESS(ADRESL,4)
// ADRESL<RES5>
extern volatile __bit                   RES5                __at(0xE8ED);	// @ (0x1D1D * 8 + 5)
#define                                 RES5_bit            _BIT_ACCESS(ADRESL,5)
// ADRESL<RES6>
extern volatile __bit                   RES6                __at(0xE8EE);	// @ (0x1D1D * 8 + 6)
#define                                 RES6_bit            _BIT_ACCESS(ADRESL,6)
// ADRESL<RES7>
extern volatile __bit                   RES7                __at(0xE8EF);	// @ (0x1D1D * 8 + 7)
#define                                 RES7_bit            _BIT_ACCESS(ADRESL,7)
// ADRESH<RES8>
extern volatile __bit                   RES8                __at(0xE8F0);	// @ (0x1D1E * 8 + 0)
#define                                 RES8_bit            _BIT_ACCESS(ADRESH,0)
// ADRESH<RES9>
extern volatile __bit                   RES9                __at(0xE8F1);	// @ (0x1D1E * 8 + 1)
#define                                 RES9_bit            _BIT_ACCESS(ADRESH,1)
// CPUDOZE<ROI>
extern volatile __bit                   ROI                 __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ROI_bit             _BIT_ACCESS(CPUDOZE,5)
// ADRPT<RPT0>
extern volatile __bit                   RPT0                __at(0xE8D0);	// @ (0x1D1A * 8 + 0)
#define                                 RPT0_bit            _BIT_ACCESS(ADRPT,0)
// ADRPT<RPT1>
extern volatile __bit                   RPT1                __at(0xE8D1);	// @ (0x1D1A * 8 + 1)
#define                                 RPT1_bit            _BIT_ACCESS(ADRPT,1)
// ADRPT<RPT2>
extern volatile __bit                   RPT2                __at(0xE8D2);	// @ (0x1D1A * 8 + 2)
#define                                 RPT2_bit            _BIT_ACCESS(ADRPT,2)
// ADRPT<RPT3>
extern volatile __bit                   RPT3                __at(0xE8D3);	// @ (0x1D1A * 8 + 3)
#define                                 RPT3_bit            _BIT_ACCESS(ADRPT,3)
// ADRPT<RPT4>
extern volatile __bit                   RPT4                __at(0xE8D4);	// @ (0x1D1A * 8 + 4)
#define                                 RPT4_bit            _BIT_ACCESS(ADRPT,4)
// ADRPT<RPT5>
extern volatile __bit                   RPT5                __at(0xE8D5);	// @ (0x1D1A * 8 + 5)
#define                                 RPT5_bit            _BIT_ACCESS(ADRPT,5)
// ADRPT<RPT6>
extern volatile __bit                   RPT6                __at(0xE8D6);	// @ (0x1D1A * 8 + 6)
#define                                 RPT6_bit            _BIT_ACCESS(ADRPT,6)
// ADRPT<RPT7>
extern volatile __bit                   RPT7                __at(0xE8D7);	// @ (0x1D1A * 8 + 7)
#define                                 RPT7_bit            _BIT_ACCESS(ADRPT,7)
// T2RST<RSEL0>
extern volatile __bit                   RSEL0               __at(0x1C88);	// @ (0x391 * 8 + 0)
#define                                 RSEL0_bit           _BIT_ACCESS(T2RST,0)
// T2RST<RSEL1>
extern volatile __bit                   RSEL1               __at(0x1C89);	// @ (0x391 * 8 + 1)
#define                                 RSEL1_bit           _BIT_ACCESS(T2RST,1)
// T2RST<RSEL2>
extern volatile __bit                   RSEL2               __at(0x1C8A);	// @ (0x391 * 8 + 2)
#define                                 RSEL2_bit           _BIT_ACCESS(T2RST,2)
// T2RST<RSEL3>
extern volatile __bit                   RSEL3               __at(0x1C8B);	// @ (0x391 * 8 + 3)
#define                                 RSEL3_bit           _BIT_ACCESS(T2RST,3)
// T2RST<RSEL4>
extern volatile __bit                   RSEL4               __at(0x1C8C);	// @ (0x391 * 8 + 4)
#define                                 RSEL4_bit           _BIT_ACCESS(T2RST,4)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x3C89);	// @ (0x791 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x3C89);	// @ (0x791 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP1STAT<RW>
extern volatile __bit                   RW                  __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0x3886);	// @ (0x710 * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0x3880);	// @ (0x710 * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// SSP1STAT<R_W>
extern volatile __bit                   R_W                 __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_W1>
extern volatile __bit                   R_W1                __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 R_W1_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<R_nW1>
extern volatile __bit                   R_nW1               __at(0x3C7A);	// @ (0x78F * 8 + 2)
#define                                 R_nW1_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<S2>
extern volatile __bit                   S2                  __at(0x3C7B);	// @ (0x78F * 8 + 3)
#define                                 S2_bit              _BIT_ACCESS(SSP1STAT,3)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x3C92);	// @ (0x792 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0xC8F);	// @ (0x191 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// PIE1<SCANIE>
extern volatile __bit                   SCANIE              __at(0x4BA);	// @ (0x97 * 8 + 2)
#define                                 SCANIE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<SCANIF>
extern volatile __bit                   SCANIF              __at(0x46A);	// @ (0x8D * 8 + 2)
#define                                 SCANIF_bit          _BIT_ACCESS(PIR1,2)
// PMD0<SCANMD>
extern volatile __bit                   SCANMD              __at(0x862);	// @ (0x10C * 8 + 2)
#define                                 SCANMD_bit          _BIT_ACCESS(PMD0,2)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0x3C95);	// @ (0x792 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0x3894);	// @ (0x712 * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x3C93);	// @ (0x792 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// SSP1CON2<SEN1>
extern volatile __bit                   SEN1                __at(0x3C88);	// @ (0x791 * 8 + 0)
#define                                 SEN1_bit            _BIT_ACCESS(SSP1CON2,0)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0x388B);	// @ (0x711 * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// CRCCON0<SETUP0>
extern volatile __bit                   SETUP0              __at(0xE52A);	// @ (0x1CA5 * 8 + 2)
#define                                 SETUP0_bit          _BIT_ACCESS(CRCCON0,2)
// CRCCON0<SETUP1>
extern volatile __bit                   SETUP1              __at(0xE52B);	// @ (0x1CA5 * 8 + 3)
#define                                 SETUP1_bit          _BIT_ACCESS(CRCCON0,3)
// OSCSTAT<SFOR>
extern volatile __bit                   SFOR                __at(0x1481);	// @ (0x290 * 8 + 1)
#define                                 SFOR_bit            _BIT_ACCESS(OSCSTAT,1)
// SCANCON0<SGO>
extern volatile __bit                   SGO                 __at(0xE496);	// @ (0x1C92 * 8 + 6)
#define                                 SGO_bit             _BIT_ACCESS(SCANCON0,6)
// CRCSHFTL<SHIFT0>
extern volatile __bit                   SHIFT0              __at(0xE508);	// @ (0x1CA1 * 8 + 0)
#define                                 SHIFT0_bit          _BIT_ACCESS(CRCSHFTL,0)
// CRCSHFTL<SHIFT1>
extern volatile __bit                   SHIFT1              __at(0xE509);	// @ (0x1CA1 * 8 + 1)
#define                                 SHIFT1_bit          _BIT_ACCESS(CRCSHFTL,1)
// CRCSHFTH<SHIFT10>
extern volatile __bit                   SHIFT10             __at(0xE512);	// @ (0x1CA2 * 8 + 2)
#define                                 SHIFT10_bit         _BIT_ACCESS(CRCSHFTH,2)
// CRCSHFTH<SHIFT11>
extern volatile __bit                   SHIFT11             __at(0xE513);	// @ (0x1CA2 * 8 + 3)
#define                                 SHIFT11_bit         _BIT_ACCESS(CRCSHFTH,3)
// CRCSHFTH<SHIFT12>
extern volatile __bit                   SHIFT12             __at(0xE514);	// @ (0x1CA2 * 8 + 4)
#define                                 SHIFT12_bit         _BIT_ACCESS(CRCSHFTH,4)
// CRCSHFTH<SHIFT13>
extern volatile __bit                   SHIFT13             __at(0xE515);	// @ (0x1CA2 * 8 + 5)
#define                                 SHIFT13_bit         _BIT_ACCESS(CRCSHFTH,5)
// CRCSHFTH<SHIFT14>
extern volatile __bit                   SHIFT14             __at(0xE516);	// @ (0x1CA2 * 8 + 6)
#define                                 SHIFT14_bit         _BIT_ACCESS(CRCSHFTH,6)
// CRCSHFTH<SHIFT15>
extern volatile __bit                   SHIFT15             __at(0xE517);	// @ (0x1CA2 * 8 + 7)
#define                                 SHIFT15_bit         _BIT_ACCESS(CRCSHFTH,7)
// CRCSHFTU<SHIFT16>
extern volatile __bit                   SHIFT16             __at(0xE518);	// @ (0x1CA3 * 8 + 0)
#define                                 SHIFT16_bit         _BIT_ACCESS(CRCSHFTU,0)
// CRCSHFTU<SHIFT17>
extern volatile __bit                   SHIFT17             __at(0xE519);	// @ (0x1CA3 * 8 + 1)
#define                                 SHIFT17_bit         _BIT_ACCESS(CRCSHFTU,1)
// CRCSHFTU<SHIFT18>
extern volatile __bit                   SHIFT18             __at(0xE51A);	// @ (0x1CA3 * 8 + 2)
#define                                 SHIFT18_bit         _BIT_ACCESS(CRCSHFTU,2)
// CRCSHFTU<SHIFT19>
extern volatile __bit                   SHIFT19             __at(0xE51B);	// @ (0x1CA3 * 8 + 3)
#define                                 SHIFT19_bit         _BIT_ACCESS(CRCSHFTU,3)
// CRCSHFTL<SHIFT2>
extern volatile __bit                   SHIFT2              __at(0xE50A);	// @ (0x1CA1 * 8 + 2)
#define                                 SHIFT2_bit          _BIT_ACCESS(CRCSHFTL,2)
// CRCSHFTU<SHIFT20>
extern volatile __bit                   SHIFT20             __at(0xE51C);	// @ (0x1CA3 * 8 + 4)
#define                                 SHIFT20_bit         _BIT_ACCESS(CRCSHFTU,4)
// CRCSHFTU<SHIFT21>
extern volatile __bit                   SHIFT21             __at(0xE51D);	// @ (0x1CA3 * 8 + 5)
#define                                 SHIFT21_bit         _BIT_ACCESS(CRCSHFTU,5)
// CRCSHFTU<SHIFT22>
extern volatile __bit                   SHIFT22             __at(0xE51E);	// @ (0x1CA3 * 8 + 6)
#define                                 SHIFT22_bit         _BIT_ACCESS(CRCSHFTU,6)
// CRCSHFTU<SHIFT23>
extern volatile __bit                   SHIFT23             __at(0xE51F);	// @ (0x1CA3 * 8 + 7)
#define                                 SHIFT23_bit         _BIT_ACCESS(CRCSHFTU,7)
// CRCSHFTT<SHIFT24>
extern volatile __bit                   SHIFT24             __at(0xE520);	// @ (0x1CA4 * 8 + 0)
#define                                 SHIFT24_bit         _BIT_ACCESS(CRCSHFTT,0)
// CRCSHFTT<SHIFT25>
extern volatile __bit                   SHIFT25             __at(0xE521);	// @ (0x1CA4 * 8 + 1)
#define                                 SHIFT25_bit         _BIT_ACCESS(CRCSHFTT,1)
// CRCSHFTT<SHIFT26>
extern volatile __bit                   SHIFT26             __at(0xE522);	// @ (0x1CA4 * 8 + 2)
#define                                 SHIFT26_bit         _BIT_ACCESS(CRCSHFTT,2)
// CRCSHFTT<SHIFT27>
extern volatile __bit                   SHIFT27             __at(0xE523);	// @ (0x1CA4 * 8 + 3)
#define                                 SHIFT27_bit         _BIT_ACCESS(CRCSHFTT,3)
// CRCSHFTT<SHIFT28>
extern volatile __bit                   SHIFT28             __at(0xE524);	// @ (0x1CA4 * 8 + 4)
#define                                 SHIFT28_bit         _BIT_ACCESS(CRCSHFTT,4)
// CRCSHFTT<SHIFT29>
extern volatile __bit                   SHIFT29             __at(0xE525);	// @ (0x1CA4 * 8 + 5)
#define                                 SHIFT29_bit         _BIT_ACCESS(CRCSHFTT,5)
// CRCSHFTL<SHIFT3>
extern volatile __bit                   SHIFT3              __at(0xE50B);	// @ (0x1CA1 * 8 + 3)
#define                                 SHIFT3_bit          _BIT_ACCESS(CRCSHFTL,3)
// CRCSHFTT<SHIFT30>
extern volatile __bit                   SHIFT30             __at(0xE526);	// @ (0x1CA4 * 8 + 6)
